# Kendall Outlaw Module 5 Project - Files, Exceptions, and SQL
### Task 2 - Read and work through Chapter 17 - Big Data - understand the examples. 
### 2/10/2023

## Page 724 Section 17.1 Introduction

## Page 728 and 729 Section 17.2 Relational Databases and Structured Query Language (SQL)

## Page 730 Section 17.2.1 A books Database

In [1]:
import sqlite3
connection = sqlite3.connect('books.db')

## Page 734 Section 17.2.2 SELECT Queries

In [3]:
import pandas as pd
connection = sqlite3.connect('books.db')
pd.options.display.max_columns = 10
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

## Page 734 and 735 Section 17.2.3 WHERE Clause

In [4]:
import pandas as pd
connection = sqlite3.connect('books.db')
pd.read_sql("""SELECT title, edition, copyright
               FROM titles
               WHERE copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

## Page 736 Section 17.2.4 ORDER BY Clause

In [7]:
import pandas as pd
connection = sqlite3.connect('books.db')
pd.read_sql('SELECT title FROM titles ORDER BY title ASC', connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

## Page 737 Section 17.2.5 Merging Data from Multiple Tables: INNER JOIN

In [14]:
import pandas as pd
connection = sqlite3.connect('books.db')
pd.read_sql("""SELECT first, last, isbn
               FROM authors
               INNER JOIN author_ISBN
                   ON authors.id = author_ISBN.id
                ORDER BY last, first""", connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

## Page 738 Section 17.2.6 INSERT INTO Statement

In [29]:
import pandas as pd
connection = sqlite3.connect('books.db')
cursor = connection.cursor()

In [36]:
import pandas as pd
connection = sqlite3.connect('books.db')
cursor = cursor.execute("""INSERT INTO authors (first, last)
                            VALUES ('Sue', 'Red')""")

OperationalError: database is locked

In [ ]:
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

## Page 739 Section 17.2.7 UPDATE Statement

In [ ]:
#Could not complete because of the INSERT INTO Statement not working

## Page 739 and 740 Section 17.2.8 DELETE FROM Statement

In [ ]:
#Could not complete because of the INSERT INTO Statement not working